x1 = int(input("Введите х координату первой точки: "))
y1 = int(input("Введите y координату первой точки: "))

x2 = int(input("Введите х координату второй точки: "))
y2 = int(input("Введите y координату второй точки: "))

x3 = int(input("Введите х координату третьей точки: "))
y3 = int(input("Введите y координату третьей точки: "))

print(f"P = {(((x2-x1)**2 + (y2 - y1)**2)**0.5) + (((x3-x1)**2 + (y3 - y1)**2)**0.5) + (((x3-x2)**2 + (y3 - y2)**2)**0.5)}")
print(f"S = {0.5 * abs((x2-x1)*(y3-y1)-(x3-x1)*(y2-y1))}")